run/regenerativeHeatExchanger/01-fluid-only/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../constant/userParameters"

solver            fluid;

startFrom         latestTime;

startTime         0;

stopAt            endTime;

endTime           2.0;

deltaT            1.0e-05;

writeControl      adjustableRunTime;

writeInterval     0.1;

purgeWrite        0;

writeFormat       ascii;

writePrecision    6;

writeCompression  off;

timeFormat        scientific;

timePrecision     8;

runTimeModifiable true;

maxCo             0.75;

maxDeltaT         0.01;

adjustTimeStep    no;

// ************************************************************************* //
