run/regenerativeHeatExchanger/01-fluid-only/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format          ascii;
    class           polyBoundaryMesh;
    location        "constant/fluid/polyMesh";
    object          boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


5 // entry0
(
    fluidInlet
    {
        type            patch;
        physicalType    patch;
        nFaces          37;
        startFace       223163;
    }
    fluidOutlet
    {
        type            patch;
        physicalType    patch;
        nFaces          37;
        startFace       223200;
    }
    cyclicFluidLeft
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          16800;
        startFace       223237;
        matchTolerance  0.0001;
        neighbourPatch  cyclicFluidRight;
        transformType   rotational;
        rotationAxis    ( 0 0 1 );
        rotationCentre  ( 0 0 0 );
        rotationAngle   60.0001;
    }
    cyclicFluidRight
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          16800;
        startFace       240037;
        matchTolerance  0.0001;
        neighbourPatch  cyclicFluidLeft;
        transformType   rotational;
        rotationAxis    ( 0 0 1 );
        rotationCentre  ( 0 0 0 );
        rotationAngle   -60.0001;
    }
    fluid_to_solid
    {
        type            wall;
        nFaces          12000;
        startFace       256837;
        transformType   none;
    }
)


// ************************************************************************* //
