run/regenerativeHeatExchanger/01-fluid-only/constant/physicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant/fluid";
    object      physicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Conservative choice: this allows for a reasonable run time and provides a
// reasonable approximation of the transport properties. Nonetheless, the
// thermodynamic properties are constant, which is not ideal (but otherwise
// the simulation can take a *long* time to run, like years). Recommended.
//
// XXX: change Cp for heating/cooling accordingly, if needed.

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       sutherland;
    thermo          hConst;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    specie
    {
        molWeight       28.85097;
    }
    thermodynamics
    {
        // Cp              1004.4; // Cooling
        Cp              1100.0; // Heating
        hf              0;
    }
    transport
    {
        As              1.67212e-06;
        Ts              170.672;
    }
}

// ************************************************************************* //
