run/regenerativeHeatExchanger/01-fluid-only/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0/fluid";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

#include "../constant/userParameters"

internalField   uniform (0 0 $inletVelocity);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    // XXX outlet is the inlet for hot gas and vice-versa!
    fluidOutlet
    {
        type            fixedValue;
        value           uniform (0 0 $inletVelocity);
    }
    fluidInlet
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
    }
    fluid_to_solid
    {
        type            noSlip;
    }
    "cyclicFluid(Left|Right)"
    {
        type            cyclic;
    }
}

// ************************************************************************* //
