run/regenerativeHeatExchanger/01-fluid-only/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -2 0 0 0 0 ];

internalField   uniform 101325.0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    // XXX outlet is the inlet for hot gas and vice-versa!
    fluidOutlet
    {
        type            zeroGradient;
    }
    fluidInlet
    {
        type            fixedValue;
        value           $internalField;
    }
    fluid_to_solid
    {
        type           zeroGradient;
    }
    "cyclicFluid(Left|Right)"
    {
        type            cyclic;
    }
}

// ************************************************************************* //
