run/regenerativeHeatExchanger/01-fluid-only/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

#include "../constant/userParameters"

internalField    uniform $fluidTemperature;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    // XXX outlet is the inlet for hot gas and vice-versa!
    fluidOutlet
    {
        type            fixedValue;
        value           uniform $fluidTemperature;
    }
    fluidInlet
    {
        type            inletOutlet;
        value           uniform $solidTemperature;
        inletValue      uniform $fluidTemperature;
    }
    fluid_to_solid
    {
        type            zeroGradient;
    }
    "cyclicFluid(Left|Right)"
    {
        type            cyclic;
    }
}


// ************************************************************************* //
