run/regenerativeHeatExchanger/01-fluid-only/system/functions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeFunc residuals (
    name   = residuals,
    fields = (p_rgh U h)
)

// ------------------------------------------------------------------------- //

#includeFunc patchFlowRate
(
    name   = flowRateInlet,
    patch  = fluidInlet,
    field  = phi
)

#includeFunc patchFlowRate
(
    name   = flowRateOutlet,
    patch  = fluidOutlet,
    field  = phi
)

// ------------------------------------------------------------------------- //

#includeFunc patchAverage
(
    name   = temperatureInlet,
    patch  = fluidInlet,
    field  = T
)

#includeFunc patchAverage
(
    name   = temperatureOutlet,
    patch  = fluidOutlet,
    field  = T
)

// ------------------------------------------------------------------------- //

#includeFunc patchAverage
(
    name   = pressureInlet,
    patch  = fluidInlet,
    field  = p
)

#includeFunc patchAverage
(
    name   = pressureOutlet,
    patch  = fluidOutlet,
    field  = p
)

// ------------------------------------------------------------------------- //

#includeFunc yPlus
(
    name   = yPlusFluid,
    patch  = fluid_to_solid
)

// ************************************************************************* //
